In [1]:
import pandas as pd

In [6]:
titanic=pd.read_csv('test.csv')
titanic

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [8]:
titanic_small = titanic[['Age','SibSp','Parch']].iloc[:10]
titanic_small

    Age  SibSp  Parch
0  34.5      0      0
1  47.0      1      0
2  62.0      0      0
3  27.0      0      0
4  22.0      1      1
5  14.0      0      0
6  30.0      0      0
7  26.0      1      1
8  18.0      0      0
9  21.0      2      0

In [9]:
import numpy as np

In [12]:
titanic_array = np.array(titanic_small)

In [11]:
np.array(['hello'])

array(['hello'], dtype='<U5')

In [14]:
np.save('titanic.npy', titanic_array)

In [15]:
titanic_array_load = np.load('titanic.npy')

In [16]:
titanic_array_load == titanic_array

array([[ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True]])

##ì‹¤ìŠµ

In [45]:
np.save('df_to_arr.npy', titanic.T.iloc[-3])

In [19]:
titanic.T.iloc[-3]

0       7.8292
1          7.0
2       9.6875
3       8.6625
4      12.2875
        ...
413       8.05
414      108.9
415       7.25
416       8.05
417    22.3583
Name: Fare, Length: 418, dtype: object

In [33]:
df_to_arr_load = np.load('df_to_arr.npy',allow_pickle=True)
df_to_arr_load

array([7.8292, 7.0, 9.6875, 8.6625, 12.2875, 9.225, 7.6292, 29.0, 7.2292,
       24.15, 7.8958, 26.0, 82.2667, 26.0, 61.175, 27.7208, 12.35, 7.225,
       7.925, 7.225, 59.4, 3.1708, 31.6833, 61.3792, 262.375, 14.5,
       61.9792, 7.225, 30.5, 21.6792, 26.0, 31.5, 20.575, 23.45, 57.75,
       7.2292, 8.05, 8.6625, 9.5, 56.4958, 13.4167, 26.55, 7.85, 13.0,
       52.5542, 7.925, 29.7, 7.75, 76.2917, 15.9, 60.0, 15.0333, 23.0,
       263.0, 15.5792, 29.125, 7.8958, 7.65, 16.1, 262.375, 7.8958, 13.5,
       7.75, 7.725, 262.375, 21.0, 7.8792, 42.4, 28.5375, 263.0, 7.75,
       7.8958, 7.925, 27.7208, 211.5, 211.5, 8.05, 25.7, 13.0, 7.75,
       15.2458, 221.7792, 26.0, 7.8958, 10.7083, 14.4542, 7.8792, 8.05,
       7.75, 23.0, 13.9, 7.775, 52.0, 8.05, 26.0, 7.7958, 78.85, 7.925,
       7.8542, 8.05, 55.4417, 26.0, 7.75, 7.775, 8.5167, 22.525, 7.8208,
       7.75, 8.7125, 13.0, 15.0458, 7.7792, 31.6792, 7.2833, 221.7792,
       14.4542, 6.4375, 16.7, 75.2417, 26.0, 15.75, 7.75, 57.75, 7.25,
       7.75, 16.1, 7.7958, 23.25, 13.0, 8.05, 8.05, 28.5, 25.4667, 6.4375,
       7.8958, 7.8542, 7.225, 13.0, 8.05, 46.9, 46.9, 151.55, 262.375,
       26.0, 26.55, 18.0, 51.8625, 8.05, 26.55, 26.0, 83.1583, 7.8958,
       nan, 12.1833, 31.3875, 7.55, 221.7792, 7.8542, 26.55, 13.775,
       7.7333, 15.2458, 13.5, 7.0, 13.0, 22.025, 50.4958, 34.375, 27.7208,
       8.9625, 7.55, 7.225, 13.9, 7.2292, 31.3875, 39.0, 36.75, 55.4417,
       39.0, 83.1583, 13.0, 83.1583, 53.1, 7.75, 247.5208, 16.0, 21.0,
       8.05, 69.55, 13.0, 26.0, 26.0, 14.5, 12.35, 32.5, 7.8542, 134.5,
       7.775, 10.5, 8.1125, 15.5, 14.4, 227.525, 26.0, 10.5, 25.7417,
       7.75, 10.5, 27.7208, 7.8958, 22.525, 7.05, 73.5, 26.0, 7.775, 42.5,
       7.8792, 164.8667, 211.5, 8.05, 13.8583, 8.05, 10.5, 7.7958,
       27.4458, 15.2458, 7.7958, 7.75, 15.1, 13.0, 65.0, 26.55, 6.4958,
       7.8792, 71.2833, 7.8542, 75.25, 7.225, 13.0, 106.425, 27.7208,
       30.0, 134.5, 7.8875, 23.45, 51.8625, 21.0, 32.5, 26.0, 14.4542,
       27.75, 7.925, 136.7792, 9.325, 9.5, 7.55, 7.75, 8.05, 13.0, 7.775,
       17.4, 7.8542, 23.0, 12.1833, 12.7375, 7.8958, 0.0, 7.55, 8.05,
       8.6625, 75.2417, 7.75, 136.7792, 15.5, 7.225, 26.0, 10.5, 26.0,
       21.0, 10.5, 8.6625, 13.775, 7.75, 15.2458, 20.2125, 7.25, 7.25,
       82.2667, 7.2292, 8.05, 39.6, 6.95, 7.2292, 81.8583, 9.5, 7.8958,
       41.5792, 21.6792, 45.5, 7.8542, 7.775, 15.0458, 21.0, 8.6625, 7.75,
       26.55, 151.55, 9.35, 93.5, 14.1083, 8.6625, 7.225, 7.575, 7.75,
       135.6333, 7.7333, 146.5208, 10.5, 7.8542, 31.5, 7.775, 7.2292,
       13.0, 26.55, 211.3375, 7.05, 39.0, 79.2, 26.0, 13.0, 36.75, 29.7,
       7.225, 15.7417, 7.8958, 26.0, 13.0, 7.2292, 31.5, 7.2292, 10.5,
       7.5792, 69.55, 512.3292, 14.5, 7.65, 13.0, 7.2292, 13.5, 21.0,
       63.3583, 10.5, 73.5, 65.0, 20.575, 26.0, 51.4792, 7.8792, 7.75,
       15.55, 69.55, 37.0042, 21.0, 8.6625, 55.4417, 69.55, 14.4583,
       39.6875, 59.4, 13.8583, 11.5, 134.5, 0.0, 13.0, 81.8583, 262.375,
       8.6625, 11.5, 50.0, 31.3875, 7.75, 7.8792, 14.5, 16.1, 12.875,
       65.0, 7.775, 13.0, 7.75, 21.075, 93.5, 39.4, 20.25, 10.5, 22.025,
       60.0, 7.25, 79.2, 7.775, 7.7333, 164.8667, 21.0, 59.4, 47.1,
       27.7208, 13.8625, 10.5, 211.5, 7.7208, 13.775, 7.75, 90.0, 7.775,
       8.05, 108.9, 7.25, 8.05, 22.3583], dtype=object)

In [44]:
df_to_arr_load[2:5].dot(df_to_arr_load[7:10])

640.30357

##ì‹¤ìŠµì •ë‹µ

In [47]:
to_file = np.array(titanic['Fare'])
to_file

array([  7.8292,   7.    ,   9.6875,   8.6625,  12.2875,   9.225 ,
         7.6292,  29.    ,   7.2292,  24.15  ,   7.8958,  26.    ,
        82.2667,  26.    ,  61.175 ,  27.7208,  12.35  ,   7.225 ,
         7.925 ,   7.225 ,  59.4   ,   3.1708,  31.6833,  61.3792,
       262.375 ,  14.5   ,  61.9792,   7.225 ,  30.5   ,  21.6792,
        26.    ,  31.5   ,  20.575 ,  23.45  ,  57.75  ,   7.2292,
         8.05  ,   8.6625,   9.5   ,  56.4958,  13.4167,  26.55  ,
         7.85  ,  13.    ,  52.5542,   7.925 ,  29.7   ,   7.75  ,
        76.2917,  15.9   ,  60.    ,  15.0333,  23.    , 263.    ,
        15.5792,  29.125 ,   7.8958,   7.65  ,  16.1   , 262.375 ,
         7.8958,  13.5   ,   7.75  ,   7.725 , 262.375 ,  21.    ,
         7.8792,  42.4   ,  28.5375, 263.    ,   7.75  ,   7.8958,
         7.925 ,  27.7208, 211.5   , 211.5   ,   8.05  ,  25.7   ,
        13.    ,   7.75  ,  15.2458, 221.7792,  26.    ,   7.8958,
        10.7083,  14.4542,   7.8792,   8.05  ,   7.75  ,  23.    ,
        13.9   ,   7.775 ,  52.    ,   8.05  ,  26.    ,   7.7958,
        78.85  ,   7.925 ,   7.8542,   8.05  ,  55.4417,  26.    ,
         7.75  ,   7.775 ,   8.5167,  22.525 ,   7.8208,   7.75  ,
         8.7125,  13.    ,  15.0458,   7.7792,  31.6792,   7.2833,
       221.7792,  14.4542,   6.4375,  16.7   ,  75.2417,  26.    ,
        15.75  ,   7.75  ,  57.75  ,   7.25  ,   7.75  ,  16.1   ,
         7.7958,  23.25  ,  13.    ,   8.05  ,   8.05  ,  28.5   ,
        25.4667,   6.4375,   7.8958,   7.8542,   7.225 ,  13.    ,
         8.05  ,  46.9   ,  46.9   , 151.55  , 262.375 ,  26.    ,
        26.55  ,  18.    ,  51.8625,   8.05  ,  26.55  ,  26.    ,
        83.1583,   7.8958,      nan,  12.1833,  31.3875,   7.55  ,
       221.7792,   7.8542,  26.55  ,  13.775 ,   7.7333,  15.2458,
        13.5   ,   7.    ,  13.    ,  22.025 ,  50.4958,  34.375 ,
        27.7208,   8.9625,   7.55  ,   7.225 ,  13.9   ,   7.2292,
        31.3875,  39.    ,  36.75  ,  55.4417,  39.    ,  83.1583,
        13.    ,  83.1583,  53.1   ,   7.75  , 247.5208,  16.    ,
        21.    ,   8.05  ,  69.55  ,  13.    ,  26.    ,  26.    ,
        14.5   ,  12.35  ,  32.5   ,   7.8542, 134.5   ,   7.775 ,
        10.5   ,   8.1125,  15.5   ,  14.4   , 227.525 ,  26.    ,
        10.5   ,  25.7417,   7.75  ,  10.5   ,  27.7208,   7.8958,
        22.525 ,   7.05  ,  73.5   ,  26.    ,   7.775 ,  42.5   ,
         7.8792, 164.8667, 211.5   ,   8.05  ,  13.8583,   8.05  ,
        10.5   ,   7.7958,  27.4458,  15.2458,   7.7958,   7.75  ,
        15.1   ,  13.    ,  65.    ,  26.55  ,   6.4958,   7.8792,
        71.2833,   7.8542,  75.25  ,   7.225 ,  13.    , 106.425 ,
        27.7208,  30.    , 134.5   ,   7.8875,  23.45  ,  51.8625,
        21.    ,  32.5   ,  26.    ,  14.4542,  27.75  ,   7.925 ,
       136.7792,   9.325 ,   9.5   ,   7.55  ,   7.75  ,   8.05  ,
        13.    ,   7.775 ,  17.4   ,   7.8542,  23.    ,  12.1833,
        12.7375,   7.8958,   0.    ,   7.55  ,   8.05  ,   8.6625,
        75.2417,   7.75  , 136.7792,  15.5   ,   7.225 ,  26.    ,
        10.5   ,  26.    ,  21.    ,  10.5   ,   8.6625,  13.775 ,
         7.75  ,  15.2458,  20.2125,   7.25  ,   7.25  ,  82.2667,
         7.2292,   8.05  ,  39.6   ,   6.95  ,   7.2292,  81.8583,
         9.5   ,   7.8958,  41.5792,  21.6792,  45.5   ,   7.8542,
         7.775 ,  15.0458,  21.    ,   8.6625,   7.75  ,  26.55  ,
       151.55  ,   9.35  ,  93.5   ,  14.1083,   8.6625,   7.225 ,
         7.575 ,   7.75  , 135.6333,   7.7333, 146.5208,  10.5   ,
         7.8542,  31.5   ,   7.775 ,   7.2292,  13.    ,  26.55  ,
       211.3375,   7.05  ,  39.    ,  79.2   ,  26.    ,  13.    ,
        36.75  ,  29.7   ,   7.225 ,  15.7417,   7.8958,  26.    ,
        13.    ,   7.2292,  31.5   ,   7.2292,  10.5   ,   7.5792,
        69.55  , 512.3292,  14.5   ,   7.65  ,  13.    ,   7.2292,
        13.5   ,  21.    ,  63.3583,  10.5   ,  73.5   ,  65.    ,
        20.575 ,  26.    ,  51.4792,   7.8792,   7.75  ,  15.55  ,
        69.55  ,  37.0042,  21.    ,   8.6625,  55.4417,  69.55  ,
        14.4583,  39.6875,  59.4   ,  13.8583,  11.5   , 134.5   ,
         0.    ,  13.    ,  81.8583, 262.375 ,   8.6625,  11.5   ,
        50.    ,  31.3875,   7.75  ,   7.8792,  14.5   ,  16.1   ,
        12.875 ,  65.    ,   7.775 ,  13.    ,   7.75  ,  21.075 ,
        93.5   ,  39.4   ,  20.25  ,  10.5   ,  22.025 ,  60.    ,
         7.25  ,  79.2   ,   7.775 ,   7.7333, 164.8667,  21.    ,
        59.4   ,  47.1   ,  27.7208,  13.8625,  10.5   , 211.5   ,
         7.7208,  13.775 ,   7.75  ,  90.    ,   7.775 ,   8.05  ,
       108.9   ,   7.25  ,   8.05  ,  22.3583])

In [48]:
np.save('df_to_arr.npy', to_file)

In [49]:
titanic_small = titanic[['Age','SibSp','Parch']].iloc[:10]

In [52]:
array_dot1 = np.array(titanic_small.iloc[:3])
array_dot1

array([[34.5,  0. ,  0. ],
       [47. ,  1. ,  0. ],
       [62. ,  0. ,  0. ]])

In [55]:
array_dot2 = np.array(titanic_small.iloc[-3:])
array_dot2

array([[26.,  1.,  1.],
       [18.,  0.,  0.],
       [21.,  2.,  0.]])

In [56]:
array_dot1.dot(array_dot2)

array([[ 897. ,   34.5,   34.5],
       [1240. ,   47. ,   47. ],
       [1612. ,   62. ,   62. ]])

In [72]:
for i in titanic_small.index:
    print(titanic_small.iloc[i,1])

0
1
0
0
1
0
0
1
0
2

In [68]:
i=0
while :
    print(titanic_small.iloc[i,1]))
    i +=1

7.8292
7.0
9.6875
8.6625
12.2875
9.225
7.6292
29.0
7.2292
24.15

In [5]:
def plus(x, y):
    return x + y
plus(1,1)

In [9]:
def append2(l2):
   global l1

[1, 2, 3, 4, 5]

In [10]:
import pandas as pd

In [11]:
df=pd.read_csv('test.csv')

In [12]:
df.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [19]:
fn1=0
for i in df.index:
    df.iloc[i,-7]>=20
    fn1+=1
fn1

418

In [31]:
def fn1(i):
    return i>=20
df['Age']=[fn1(i) for i in df['Age']]
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,False,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,False,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,False,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,False,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,False,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,False,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,False,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,False,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,False,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,False,1,1,2668,22.3583,NaN,C

In [37]:
j=0
def fn2(i):
    global j
    global df
    df.loc[j,'Age']=i>=20
    j+=1
[fn1(i) for i in df['Age']]
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,False,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,False,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,False,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,False,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,False,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,False,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,False,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,False,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,False,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,False,1,1,2668,22.3583,NaN,C

In [47]:
str.count(sub[, start[, end]])

TypeError: list indices must be integers or slices, not str

In [61]:
for i in range(len(df['Name'])):
    df['Name'][i]+=df['Name'][i].count('.').count(',')
df['Name']

AttributeError: 'int' object has no attribute 'count'

In [62]:
df['Name'].index

RangeIndex(start=0, stop=418, step=1)

In [66]:
df['Name'].str.count(',')

0      1
1      1
2      1
3      1
4      1
      ..
413    1
414    1
415    1
416    1
417    1
Name: Name, Length: 418, dtype: int64

In [70]:
count_str = [nm.count(',') + nm.count('.') for nm in df['Name']]
count_blank = [nm.count(' ') >= 2 for nm in df['Name']]
print(count_str)
print(count_blank)

[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True]